---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAzimuthValue
source: html/5fc4c592-0199-680f-8a21-0b57cce5f083.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAzimuthValue Property

"Lighting azimuth"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyLightingAzimuthValue { get; }
```